snlkuharlocal/src/InformationRegisters/ИДКоробок/ИДКоробок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИДКоробок</name>
  <resources>
    <name>ЛистНабора</name>
    <type>
      <types>DocumentRef.ЛистНабора</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаЗаписи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>ИДКоробки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/InformationRegisters/ИДКоробок/ManagerModule.bsl
Функция ЗаписатьИдКоробок(Знач ИД,Знач Документ, ДатаЗаписи = Неопределено) Экспорт
	РезультатЗаписи = МаркировкаКС.СтруктураРезультата(ложь); 
    Если ДатаЗаписи = Неопределено Тогда
	
		ДатаЗаписи = ТекущаяДатаСеанса(); 	
	
	КонецЕсли;
	МенеджерЗаписи = РегистрыСведений.ИДКоробок.СоздатьМенеджерЗаписи(); 
	МенеджерЗаписи.ИДКоробки = Ид; 
	МенеджерЗаписи.ЛистНабора = Документ; 
    МенеджерЗаписи.ДатаЗаписи = ДатаЗаписи; 
	
	Попытка
	
		МенеджерЗаписи.Записать(ложь); 
		
		РезультатЗаписи.Успешно = Истина; 
	
	Исключение
	    РезультатЗаписи.Успешно = Ложь; 
		//++Данилова Е.В. 03.03.2026 SNL-123 
		//РезультатЗаписи.Ошибки.Добавить(ОписаниеОшибки());
		РезультатЗаписи.Ошибки.Добавить("Отсканирован некорректный код коробки!");
		//--Данилова Е.В. 03.03.2026 
	КонецПопытки;
	
	Возврат РезультатЗаписи; 
КонецФункции   

Функция НайтиЛНПоQRКоду(Знач ИД)  Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИДКоробок.ЛистНабора КАК ЛистНабора
		|ИЗ
		|	РегистрСведений.ИДКоробок КАК ИДКоробок
		|ГДЕ
		|	ИДКоробок.ИДКоробки = &ИДКоробки";
	
	Запрос.УстановитьПараметр("ИДКоробки", ИД);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат  ВыборкаДетальныеЗаписи.ЛистНабора; 
	КонецЕсли;
	
	Возврат Неопределено; 


КонецФункции // НайтиЛНПоQRКоду()

Функция НайтиQRКодЛН(Знач ЛистНабора) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ИДКоробок.ИДКоробки КАК ИДКоробки
		|ИЗ
		|	РегистрСведений.ИДКоробок КАК ИДКоробок
		|ГДЕ
		|	ИДКоробок.ЛистНабора = &ЛистНабора
		|
		|УПОРЯДОЧИТЬ ПО
		|	ИДКоробок.ДатаЗаписи УБЫВ";
	
	Запрос.УстановитьПараметр("ЛистНабора", ЛистНабора);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		
		Возврат ВыборкаДетальныеЗаписи.ИДКоробки; 	
		
	КонецЕсли;

    Возврат ""; 
	
КонецФункции // НайтиQRКодЛН()
